In [1]:
import pandas as pd

In [2]:
df1=pd.read_csv('../data/accounts.0.csv')

In [3]:
df2=pd.read_csv('../data/accounts.1.csv')

### Web Scraping

In [ ]:
from selenium import webdriver

from selenium.webdriver.chrome.options import Options

import time

In [ ]:
PATH='driver/chromedriver_linux'

In [ ]:
url='https://www.bloomberg.com/markets/stocks'

In [ ]:
# opciones del driver


opciones=Options()

opciones.add_experimental_option('excludeSwitches', ['enable-automation'])
opciones.add_experimental_option('useAutomationExtension', False) # me ocultan como robot

opciones.headless=False    # si True, no sale la ventana del browser

#opciones.add_argument('--start-maximized') # empezar maximizado

#opciones.add_argument('user-data-dir=selenium') # guarda las cookies

opciones.add_argument('driver/adblock.crx')  # adblocker

In [ ]:
driver=webdriver.Chrome(PATH, options=opciones)

driver.get(url)

time.sleep(2)

titulos=[e.text for e in driver.find_elements_by_class_name('table-container__header')]
#titulos[2]='Asia Pacific'


tablas=driver.find_elements_by_tag_name('table')

cabeceras=[[e.text for e in t.find_element_by_tag_name('thead').find_elements_by_tag_name('th')] for t in tablas]


data=[]

for i, tabla in enumerate(tablas):
    
    filas=tabla.find_element_by_tag_name('tbody').find_elements_by_tag_name('tr')
    
    elementos=[]
    
    for fila in filas:
        
        elementos.append([e.text for e in fila.find_elements_by_tag_name('td')])
    
    data.append((pd.DataFrame(elementos, columns=cabeceras[i][:-1])))

In [ ]:
df=data[0]

In [ ]:
tabla_2=driver.find_element_by_xpath('/html/body/div[6]/main/div/div/div[4]/div[8]/div/table')

In [ ]:
[e.text for e in tabla_2.find_element_by_tag_name('thead').find_elements_by_tag_name('th')]

### API Bla BLa Car

In [ ]:
import requests as req

In [ ]:
url='https://api.coindesk.com/v1/bpi/currentprice.json'

In [ ]:
req.get(url)

In [ ]:
req.get(url).json()

In [ ]:
endpoint='https://api.coindesk.com/v1/bpi/historical/close.json?start=2012-09-01&end=2013-09-05'

In [ ]:
data=req.get(endpoint).json()

In [ ]:
pd.DataFrame(data)

In [ ]:
url='https://exoplanetarchive.ipac.caltech.edu/cgi-bin/nstedAPI/nph-nstedAPI?&table=exoplanets&format=ipac&where=pl_kepflag=1'

In [ ]:
data=req.get(url)

In [ ]:
data

### dataframes

In [ ]:
pd.merge(df1, df2)

In [6]:
df1.join(df2,how='left', on='id', lsuffix='_df1', rsuffix='_df2')

        id_df1 names_df1  amount_df1  id_df2 names_df2  amount_df2
0           23    Ursula        1380     193     Quinn         116
1           92       Tim        -178     300     Kevin         -56
2          239     Alice        -784      45       Bob         730
3          260   Michael        -249     458   Charlie         796
4          314     Jerry        1299     340       Bob         387
...        ...       ...         ...     ...       ...         ...
999995      60    Oliver         176     418    Victor        -506
999996     440     Sarah        1292     322     Alice         -73
999997      24    Victor         559      56     Kevin        1020
999998      66    George        2093      38     Jerry        2052
999999      39     Frank         204     388       Bob        1045

[1000000 rows x 6 columns]

In [9]:
pd.concat([df1, df2]).to_csv('data.csv')

In [10]:
pd.concat([df1, df2], axis=1)

         id    names  amount   id    names  amount
0        23   Ursula    1380  269    Laura     697
1        92      Tim    -178  195  Michael     118
2       239    Alice    -784   28   George     730
3       260  Michael    -249  356      Ray     215
4       314    Jerry    1299  234   Xavier    2907
...     ...      ...     ...  ...      ...     ...
999995   60   Oliver     176  251   Yvonne     203
999996  440    Sarah    1292  492   Yvonne      71
999997   24   Victor     559   20  Michael      99
999998   66   George    2093   81  Norbert    1885
999999   39    Frank     204  432  Charlie     519

[1000000 rows x 6 columns]

In [12]:
# seleccion

In [17]:
df1[['names', 'amount']].head()

     names  amount
0   Ursula    1380
1      Tim    -178
2    Alice    -784
3  Michael    -249
4    Jerry    1299

In [20]:
df1.loc[4, ['names', 'amount']]  # fila 4 de esas dos columnas

names     Jerry
amount     1299
Name: 4, dtype: object

In [25]:
df1.iloc[4, 1:3]  # fila 4 de esas dos columnas, indices del 1 al 3

names     Jerry
amount     1299
Name: 4, dtype: object

### SQL

In [26]:
!pip install SQLAlchemy

In [32]:
from sqlalchemy import create_engine

In [34]:
# lenguaje+driver://usuario:password@servidor:puerto/database

str_conn='mysql+pymysql://root:password@localhost:3306/prueba_pandas'

motor=create_engine(str_conn)

In [35]:
df1.to_sql('usuarios', con=motor)

In [38]:
df_sql=pd.read_sql('select names from usuarios where amount>300', motor)

In [39]:
df_sql.head()

    names
0  Ursula
1   Jerry
2  Ursula
3   Jerry
4   Zelda